package postscript;

public class PostScript {
/*
	写个后记，水个行数，凑个整。
	
	现在时间2022年6月18日20:53:02
	
	纪事表：
		Java基础阶段：
				2022年2月21日前后----2022年3月12日前后
		算法学习阶段：
				2022年3月12日前后----2022年6月18日20:57:08
	
	Java基础阶段历时20天左右
	算法学习阶段历时98天左右，2352小时，141120分钟
	
	代码换行符(正则表达式查找)共计 25000个
	厚脸皮点就是25000行，但估计去除空行也就剩个20000行左右
	
	本来估计学完要到7月份，没想到进度提前了，可喜可贺，可喜可贺。
	
	反思：
		1.代码不够规范：
			前期对面向对象不太熟悉，在类的处理上有些随便；
			命名有些不太规范，需要注意；
			基本没有任何注释，二次修改时会很麻烦，在深入学习C++时需要注意；
		2.时间复杂度与空间复杂度需要重点注意和学习！尤其要注意性能(代码的内循环与空间占用)！
			(主要使用C++，所以这一关于java语言本身特性的部分就没有深入了解)
		3.红黑树，AVL二叉查找树，B-树有点难，有点小蒙圈，需要深入学习！
		4.最后就是应该多多对学习到的算法及其背后思想进行应用实践，多多结合具体项目以尝试实际开发
		5.经常复习，温故而知新；
		6.算法还远没有结束，这才只是开始！继续努力吧！
			《算法导论》还在等着哦！
	
	
	“到达世界最高城算法！
		太美丽啦算法，哎呀这不《算法 第四版》吗？
				还是看看远处的《算法导论》吧家人们。”
	(笑)
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	水
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	水
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	~
	《算法 第四版》就到这里结束啦，水个行数，水到25000个换行符。
		完结撒花！
*/
}
